nbd_fio_results/dev-nbd0_2023-07-17_17:16/rand_r_nbd0_1iodepth_1threads/1024.txt
rand-read: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

rand-read: (groupid=0, jobs=1): err= 0: pid=13692: Mon Jul 17 17:17:45 2023
   read: IOPS=1372, BW=1372MiB/s (1439MB/s)(26.8GiB/20001msec)
    slat (usec): min=52, max=448, avg=92.64, stdev=32.08
    clat (usec): min=340, max=208734, avg=633.86, stdev=3267.20
     lat (usec): min=447, max=208852, avg=726.92, stdev=3267.44
    clat percentiles (usec):
     |  1.00th=[   408],  5.00th=[   461], 10.00th=[   486], 20.00th=[   506],
     | 30.00th=[   523], 40.00th=[   537], 50.00th=[   545], 60.00th=[   562],
     | 70.00th=[   594], 80.00th=[   627], 90.00th=[   725], 95.00th=[   857],
     | 99.00th=[   988], 99.50th=[  1012], 99.90th=[  1123], 99.95th=[  4293],
     | 99.99th=[206570]
   bw (  MiB/s): min=  800, max= 1598, per=100.00%, avg=1378.92, stdev=290.84, samples=39
   iops        : min=  800, max= 1598, avg=1378.92, stdev=290.84, samples=39
  lat (usec)   : 500=16.40%, 750=74.41%, 1000=8.45%
  lat (msec)   : 2=0.68%, 10=0.03%, 250=0.03%
  cpu          : usr=0.73%, sys=6.86%, ctx=192796, majf=0, minf=560
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=27444,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1372MiB/s (1439MB/s), 1372MiB/s-1372MiB/s (1439MB/s-1439MB/s), io=26.8GiB (28.8GB), run=20001-20001msec

Disk stats (read/write):
  nbd0: ios=218578/0, merge=0/0, ticks=102354/0, in_queue=83896, util=86.02%